const datalocal = {
    "type": "map",
    "joinBy": "id",
    "mapDatalocal": [
      {
        "id": "id0",
        "name": "Hamamözü",
        "path": "M-377,385,-380,415,-347,510,-329,524,-289,525,-294,482,-309,442L-330,410L-344,397,-363,391z"
      },
      {
        "id": "id1",
        "name": "Gümüşhacıköy",
        "path": "M-289,525,-258,530,-265,492,-259,444,-239,427,-216,424,-196,419,-194,380L-205,332,-229,294,-234,263,-306,237,-350,230L-346,265,-371,330,-377,385,-343,396,-314,430L-295,474Z"
      },
      {
        "id": "id2",
        "name": "Merzifon",
        "path": "M-259,531,-220,538,-174,563,-154,535,-118,542,-89,525,-82,491,-82,467,-66,447,-61,396,-39,370,-49,340,-144,275,-171,280,-233,265,-227,297,-207,330,-196,371,-195,420,-235,427,-256,442,-264,488z"
      },
      {
        "id": "id3",
        "name": "Suluova",
        "path": "M-89,525,-31,537,-12,537,13,524,47,464L90,446,128,387,101,375,51,382,-25,378L-40,372,-59,397,-66,449,-81,470z"
      },
      {
        "id": "id4",
        "name": "Amasya Merkez",
        "path": "M-174,562,-152,535,-119,542,-88,525,-29,537L-10,536,14,522,46,465,91,446,128,387,155,400,174,402,185,420L191,441,196,500,252,554,309,628,236,683,204,684,159,672,134,647L85,638L50,643,28,688,6,680,-4,654L-30,635L-66,663,-108,643,-153,637,-149,587,-159,569z"
      },
      {
        "id": "id5",
        "name": "Taşova",
        "path": "M174,400,231,360,236,347,246,302,285,313,324,320,339,331,331,354,381,387,374,387,364,394,360,420,380,440,392,491,376,552,308,628L250,552,197,500,191,437Z"
      },
      {
        "id": "id6",
        "name": "Göynücek",
        "path": "M-153,638,-104,642,-64,664,-29,635,-4,655L5,679,29,690,15,725L-23,775L-35,783L-70,795,-103,818,-122,865,-155,860,-196,860,-216,845,-223,832,-211,756,-169,690z"
      }
    ],
    "data": [
      {
        "id": "id0",
        "y": 4003
      },
      {
        "id": "id1",
        "y": 14472
      },
      {
        "id": "id2",
        "y": 76266
      },
      {
        "id": "id3",
        "y": 46986
      },
      {
        "id": "id4",
        "y": 148908
      },
      {
        "id": "id5",
        "y": 30882
      },
      {
        "id": "id6",
        "y": 2914
      }
    ]
  }

  const mapChart = Highcharts.mapChart('container', {

    chart: {
        map: datalocal,

        height: 600
    },

    title: {
        text: 'Amasya İlçeleri Nüfus Bilgisi'
    },



    mapNavigation: {
        enabled: true,
        buttonOptions: {
            verticalAlign: 'bottom'
        }
    },
    credits: {
        enabled: false
    },
    legend: {
        enabled: false
    },


    tooltip: {
        pointFormat: '{point.name}: <b>{point.y}</b>',

    },
    colorAxis: {
        min: 0,
        minColor: '#e0f3ff',
        maxColor: '#0052b4',
        visible: true
    },


    series: [{
        data: datalocal.data,
        mapData: datalocal.mapDatalocal,
        joinBy: 'id',
        name: 'Nüfus',
        
        states: {
            hover: {
                color: '#BADA55'
            }
        },

        dataLabels: {
            enabled: false,
            format: '{point.name}'
        },
        colorKey: 'y',
    }]
});