const datalocal = {
    "type": "map",
    "joinBy": "id",
    "mapDatalocal": [
      {
        "id": "id0",
        "name": "Gölkaya",
        "path": "M-521,791,-481,752,-531,685,-517,666,-441,630,-424,618,-409,594,-395,586,-346,620,-366,713,-401,789,-399,806,-463,818z"
      },
      {
        "id": "id1",
        "name": "Kaynaşlı",
        "path": "M-399,805,-284,781,-241,824,-140,812,-73,767,-84,637,-101,625,-183,599,-212,604,-225,616,-257,655,-357,664,-366,716,-400,788z"
      },
      {
        "id": "id2",
        "name": "Düzce Merkez",
        "path": "M-355,662,-345,619,-393,586,-342,539,-328,529,-314,513,-347,496,-356,473,-354,441,-351,431,-327,419,-313,404,-277,394,-230,389,-174,392,-185,417,-185,455,-140,510,-36,561,-83,639,-100,625,-182,598,-212,604,-257,655z"
      },
      {
        "id": "id3",
        "name": "Çilimli",
        "path": "M-394,585,-341,537,-328,528,-314,513,-347,498,-356,474,-355,440,-351,432,-396,448,-453,459,-437,482,-430,553z"
      },
      {
        "id": "id4",
        "name": "Cumayeri",
        "path": "M-470,451,-452,460,-438,483,-436,503,-491,528,-524,535,-568,543,-563,515,-516,496z"
      },
      {
        "id": "id5",
        "name": "Gümüşova",
        "path": "M-436,503,-431,553,-395,586,-410,594,-425,618,-442,629,-516,665,-532,685,-571,673,-590,607,-568,543,-490,528z"
      },
      {
        "id": "id6",
        "name": "Akçakoca",
        "path": "M-490,309,-477,345,-441,381,-470,450,-453,459,-396,448,-351,431,-326,417,-314,403,-274,393,-231,389,-174,392,-145,374,-83,358,-60,336,-124,270,-156,227,-198,262,-255,290z"
      },
      {
        "id": "id7",
        "name": "Yığılca",
        "path": "M-37,561,95,540,169,507,176,483,218,459,221,387,217,345,73,340,32,329,-11,336,-59,337,-82,358,-144,376,-173,392,-185,416,-185,457,-141,509z"
      }
    ],
    "data": [
      {
        "id": "id0",
        "y": 20962
      },
      {
        "id": "id1",
        "y": 20679
      },
      {
        "id": "id2",
        "y": 259527
      },
      {
        "id": "id3",
        "y": 19097
      },
      {
        "id": "id4",
        "y": 16091
      },
      {
        "id": "id5",
        "y": 17198
      },
      {
        "id": "id6",
        "y": 41363
      },
      {
        "id": "id7",
        "y": 14948
      }
    ]
  }

const mapChart = Highcharts.mapChart('container', {

    chart: {
        map: datalocal,

        height: 600
    },

    title: {
        text: 'Düzce İlçeleri Nüfus Bilgisi'
    },



    mapNavigation: {
        enabled: true,
        buttonOptions: {
            verticalAlign: 'bottom'
        }
    },
    credits: {
        enabled: false
    },
    legend: {
        enabled: false
    },


    tooltip: {
        pointFormat: '{point.name}: <b>{point.y}</b>',

    },
    colorAxis: {
        min: 0,
        minColor: '#e0f3ff',
        maxColor: '#0052b4',
        visible: true
    },


    series: [{
        data: datalocal.data,
        mapData: datalocal.mapDatalocal,
        joinBy: 'id',
        name: 'Nüfus',
        
        states: {
            hover: {
                color: '#BADA55'
            }
        },

        dataLabels: {
            enabled: false,
            format: '{point.name}'
        },
        colorKey: 'y',
    }]
});